## Central account
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                     NAME                                     |
|--------|------------------------------------------------------------------------------|
| add    | `module.gh_oidc_roles.aws_iam_role.this[&quot;ConfigTerraformAdministratorRole&quot;]` |
| delete | `module.gh_oidc_roles.aws_iam_role.this[0]`                                  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.gh_oidc_roles.aws_iam_role.this[0] will be destroyed
  # (because resource does not use count)
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::871282759583:role/ConfigTerraformAdministratorRole" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringLike = {
                              - token.actions.githubusercontent.com:sub = [
                                  - "repo:cds-snc/cloud-based-sensor:*",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::871282759583:oidc-provider/token.actions.githubusercontent.com"
                        }
                      - Sid       = ""
                    },
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = [
                              - "arn:aws:iam::957818836222:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::866996500832:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::817721384391:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::806545929748:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::800095993820:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::796730610681:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::794722365809:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::762579868088:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::729164266357:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::723936812785:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::687401027353:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::637287734259:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::521732289257:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::472286471787:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::414662622316:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::307395567143:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::296255494825:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::283582579564:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::239043911459:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::127893201980:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::073494947131:role/ConfigTerraformAdminExecutionRole",
                            ]
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-01-27T20:51:10Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ConfigTerraformAdministratorRole" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AdministratorAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ConfigTerraformAdministratorRole" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = "2023-12-18T13:54:52Z"
              - region         = "ca-central-1"
            },
        ] -> null
      - tags                  = {
          - "CostCentre" = "cbs-871282759583"
          - "Terraform"  = "true"
        } -> null
      - tags_all              = {
          - "CostCentre" = "cbs-871282759583"
          - "Terraform"  = "true"
        } -> null
      - unique_id             = "AROA4VXD726PQKTOQQPXG" -> null

      - inline_policy {}
    }

  # module.gh_oidc_roles.aws_iam_role.this["ConfigTerraformAdministratorRole"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + token.actions.githubusercontent.com:sub = [
                                  + "repo:cds-snc/cloud-based-sensor:*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::871282759583:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = ""
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::957818836222:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::866996500832:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::817721384391:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::806545929748:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::800095993820:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::796730610681:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::794722365809:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::762579868088:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::729164266357:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::723936812785:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::687401027353:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::637287734259:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::521732289257:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::472286471787:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::414662622316:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::307395567143:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::296255494825:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::283582579564:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::239043911459:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::127893201980:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::073494947131:role/ConfigTerraformAdminExecutionRole",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ConfigTerraformAdministratorRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "CostCentre" = "cbs-871282759583"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cbs-871282759583"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.log_archive_access_bucket.aws_s3_bucket.this,
  on .terraform/modules/log_archive_access_bucket/S3_log_bucket/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 7 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.log_archive_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.log_archive_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.log_archive_encrypt"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.log_archive"]

23 tests, 19 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
